DSU/src/InformationRegisters/ТочкиАктуальности/ТочкиАктуальности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТочкиАктуальности</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУчетн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DSU/src/CommonModules/ОбщегоНазначения/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбновитьТочкуАктуальности() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ТочкиАктуальностиСрезПоследних.Период) КАК ДатаАктуальности
	               |ПОМЕСТИТЬ ДатыАктуальности
	               |ИЗ
	               |	РегистрСведений.ТочкиАктуальности.СрезПоследних КАК ТочкиАктуальностиСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТочкиАктуальностиСрезПоследних.Период КАК Дата,
	               |	СУММА(ТочкиАктуальностиСрезПоследних.СуммаУчетн) КАК Сумма
	               |ИЗ
	               |	РегистрСведений.ТочкиАктуальности.СрезПоследних КАК ТочкиАктуальностиСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыАктуальности КАК ДатыАктуальности
	               |		ПО ТочкиАктуальностиСрезПоследних.Период = ДатыАктуальности.ДатаАктуальности
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТочкиАктуальностиСрезПоследних.Период";
	ТабЗапрос = Запрос.Выполнить().Выгрузить();			   
	ПараметрыСеанса.ТочкаАктуальности = Новый ФиксированнаяСтруктура("Дата,Сумма", ТабЗапрос[0].Дата, ТабЗапрос[0].Сумма);
	
КонецПроцедуры	

#КонецОбласти
